Repository: gNoName24/InitTools
Catalog: old/resources/locales/*/LC_MESSAGES/InitWindow.po
Languages: ru

source: init_GLFW
ru: Инициализация GLFW

source: init_GLFW.error."glfwInit() != GLFW_TRUE"
ru: GLFW initialization error: glfwInit() != GLFW_TRUE

source: init_GLAD
ru: Инициализация GLAD

source: init_GLAD.error."!gladLoadGLLoader((GLADloadproc) glfwGetProcAddress)"
ru: Ошибка инициализации GLAD: !gladLoadGLLoader((GLADloadproc) glfwGetProcAddress)

source: new_window.created
ru: Окно "{}" создано

source: InitWindow_WindowClass.prefix
ru: [окно {}]

source: InitWindow_WindowClass::init_window
ru: Инициализация окна

source: InitWindow_WindowClass::init_window.error."window == nullptr"
ru: Ошибка инициализации окна: window == nullptr

source: InitWindow_WindowClass::init_window.set_parameters
ru: Установка параметров

source: InitWindow_WindowClass::init_window.wayland_in_linux
ru: Событие GLFW WindowPosCallback не поддерживается Wayland

source: InitWindow_WindowClass::while_start
ru: Запуск цикла (while)

source: InitWindow_WindowClass::render_thread_start
ru: Запуск потока рендера

source: InitWindow_WindowClass::render_thread_start.error."!gladLoadGLLoader((GLADloadproc) glfwGetProcAddress)"
ru: Ошибка запуска потока рендера: !gladLoadGLLoader((GLADloadproc) glfwGetProcAddress)

source: InitWindow_WindowClass::render_thread_stop
ru: Остановка потока рендера
